app/Controllers/Admin.php

    public function dashboard()
    {
        // Check if user is logged in
        if (!$this->session->get('admin_logged_in')) {
            log_message('debug', 'Dashboard access denied - Not logged in');
            return redirect()->to(base_url('admin_login'));
        }

        log_message('debug', 'Dashboard accessed by: ' . $this->session->get('admin_username'));

        // Get all certificates with pagination
        $data = [
            'title' => 'Dashboard',
            'certificates' => $this->certificateModel->paginate(10),
---
SELECT *
FROM `certificates`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `certificates`

    public function viewCertificate($id = null)
    {
        // Check if user is logged in
        if (!$this->session->get('admin_logged_in')) {
            return redirect()->to(base_url('admin_login'));
        }

        $certificate = $this->certificateModel->find($id);
---
SELECT *
FROM `certificates`
WHERE `certificates`.`id` = '16'

    public function verifyCertificate($id = null)
    {
        // Check if user is logged in
        if (!$this->session->get('admin_logged_in')) {
            return redirect()->to(base_url('admin_login'));
        }

        $certificate = $this->certificateModel->find($id);
        if (!$certificate) {
            return redirect()->to('admin/dashboard')->with('error', 'Certificate not found');
        }

        if ($this->certificateModel->update($id, ['is_verified' => 1])) {
---
SELECT *
FROM `certificates`
WHERE `certificates`.`id` = '16'
UPDATE `certificates` SET `is_verified` = 1, `updated_at` = '2025-06-13 15:41:38'
WHERE `certificates`.`id` IN ('16')

    public function deleteCertificate($id = null)
    {
        // Check if user is logged in
        if (!$this->session->get('admin_logged_in')) {
            return redirect()->to(base_url('admin_login'));
        }

        $certificate = $this->certificateModel->find($id);
        if (!$certificate) {
            return redirect()->to('admin/dashboard')->with('error', 'Certificate not found');
        }

        // Delete the certificate image if exists
        if (!empty($certificate['image_path'])) {
            $imagePath = FCPATH . $certificate['image_path'];
            if (file_exists($imagePath)) {
                unlink($imagePath);
            }
        }

        if ($this->certificateModel->delete($id)) {
---
SELECT *
FROM `certificates`
WHERE `certificates`.`id` = '21'
DELETE FROM `certificates`
WHERE `id` IN ('21')