app/Controllers/Certificate.php

    public function verify()
    {
        $certificateNumber = $this->request->getGet('certificate_number');

        if (empty($certificateNumber)) {
            return view('verify', [
                'error' => 'Please enter a certificate number',
                'certificate' => null
            ]);
        }

        $certificate = $this->certificateModel->where('certificate_number', $certificateNumber)->first();
---
SELECT *
FROM `certificates`
WHERE `certificate_number` = 'test0003/smec/0001gg2222'
 LIMIT 1